{
  
}

// Рефлексия. 
/* 
    Задача №4. Проверка строки на палиндром.
    Решение аналогично рекомендации. 
    Использовал функции удаления первого и последнего элемента. 
    При этом сравнивая их на неравенство. Если не равны, значит результат false.
    
    Задача №5. Минимальный элемент деки за O(1).
    Решение аналогично рекомендации. Но я не обработал условие:
    "если удаляемый элемент равен первому элементу дополнительной деки, то удаляем его и из дополнительной деки."

	Задача №6. Двусторонняя очередь на базе динамического массива.
	Я посчитал необходимым реализовать заполнение динамического массива из центра с помощью заранее известных индексов.
    Но как использовать очередь в массиве не понял.
*/
